{
  "myname": "Blake Stephens",
  "subtitle": "Dev Portfolio",
  "homepage": "about",
  "pages": {
    "about": {
      "intro": {
        "greeting": "Hey, I'm Blake.",
        "desc": "I'm a software developer and an enthusiast of computer science and programming. I have spent the last four years earning a Bachelor's Degree in Computer Science to satisfy my long-running fascination with computers and to build functional skills for use in a career. Over the past several years I've spent in school I learned how to be effective at dedicating myself to filling gaps in my knowledge as I encounter them. My eagerness to impress drives my motivation to get better at everything I do.",
        "gh": "GitHub",
        "li": "LinkedIn",
        "ghurl": "https://github.com/sqthreer",
        "liurl": "https://www.linkedin.com/in/blake-stephens-01bb5a42/"
      },
      "bio1": {
        "header": "Education",
        "desc": "I have spent the past six years finishing my Associate's Degree and getting my Bachelor's in Computer Science. The courses for my major introduced me to the fundamentals of a broad range of computer science principles.",
        "subheader1": "Degrees",
        "degree1": {
          "header": "Bachelor of Science in Computer Science",
          "date": "September 2018 to December 2022",
          "gpa": "Major GPA: 3.57"
        },
        "degree2": {
          "header": "Associate Degree in General Studies",
          "date": "September 2016 to September 2018"
        },
        "subheader2": "Courses",
        "courses": [
          "Data Structures",
          "Computer Systems Programming",
          "Programming Methodologies and Software Implementation",
          "Elements of Software Engineering",
          "Principles of Programming Languages",
          "Operating Systems",
          "Algorithms and Complexity",
          "Database Management Systems",
          "Computational Structures",
          "Programming in Rust",
          "Web Development",
          "Code Reading & Review",
          "Exploring Fractals",
          "Computer Security",
          "Linear Algebra",
          "Calculus",
          "Discrete Mathematics"
        ]
      },
      "bio2": {
        "header": "Otherwise",
        "desc1": "Outside of computers and programming I like to be in the outdoors. It can be a solo adventure to a new fishing spot, a few friends on a camping trip or boogie boarding in the freezing Pacific ocean-- and I'll be happy.",
        "desc2": "At home, if I'm not working on coding projects I like to read, draw, or build. Generally I prefer to spend my time either making something or moving around."
      }
    },

    "experience": {
      "intro": "My work and programming experience includes code collaboration with peers, designing and building computer science course material and troubleshooting Linux infrastructure.\r",

      "exp1": {
        "header": "Lab Facilitator",
        "subheader": "Portland State University",
        "date": "September 2021 to December 2022",
        "desc": "My general responsibilities were to present short lectures on data structures to lower-level computer science students and be available during labs to help debug or answer conceptual questions.",
        "list": [
          "Presenting and explaining data structure concepts to groups of students in labs",
          "Guiding individual students to solutions for programming problems using C++",
          "Developing and maintaining C++ code bases for use in computer science labs",
          "Coordinating lab and lecture materials development with project management software",
          "Proctoring student exams and coding proficiency demonstrations",
          "Training new employees with debugging exercises and code discussions"
        ]
      },

      "exp2": {
        "header": "Frontend Developer",
        "subheader": "PSU: Capstone Project",
        "date": "March 2022 to September 2022",
        "desc": "My participation in the Capstone project got me introduced to git workflows, front-end technologies and frameworks, and the beauty of collaboration.",
        "list": [
          "Developing an interactive web application using Node and React with TypeScript",
          "Data modeling for a graph data structure implemented with an MVC architecture",
          "Scrum-like collaborative procedures with a team of peers",
          "Collaborating with CI/CD using git and GitLab",
          "Researching unfamiliar technologies for use in project development"
        ]
      },

      "exp3": {
        "header": "Help Desk Volunteer",
        "subheader": "Portland State University",
        "date": "October 2020 to May 2021",
        "desc": "As a member of The Computer Action Team -the organization responsible for the technical infrastructure of Maseeh College of Engineering and Computer Science- I learned how to listen to users describe their IT issues and respectfully guide them to solutions. Much of our day-to-day responsibilities involved writing and running scripts in a Linux environment to gather information or solve problems.",
        "list": [
          "Working directly with MCECS students and faculty for IT troubleshooting",
          "Collaborating on revisions to technical documentation and website content",
          "Attending weekly informational presentations on IT subjects",
          "Troubleshooting Linux system infrastructure issues"
        ]
      }
    },

    "skills": {
      "intro": "I am very open to learning new technologies and using best practices when coding and developing.",
      "skill1": {
        "header": "Language",
        "desc": "C, C++, Python, Java, HTML, CSS, TypeScript/JavaScript, Bash Script, Rust, SQL"
      },

      "skill2": {
        "header": "Technology",
        "desc": "Linux, Git, GDB, SQLite, PostreSQL, JSON, Regex"
      },

      "skill3": {
        "header": "Libraries/Frameworks",
        "desc": "C++ STL, ReactJS, NodeJS, Bootstrap, jQuery/AJAX"
      },

      "skill4": {
        "header": "IDEs/Editors",
        "desc": "Vim, VS Code, IntelliJ IDEA, PyCharm"
      },

      "skill5": {
        "header": "Design",
        "desc": "Photoshop"
      }
    },

    "work": {
      "intro": "Some of the below are assignments from coursework, others are personal projects. I tend to take on personal projects to gain familiarity with languages or libraries while solving some kind of problem.",
      "proj1": {
        "header": "Isle of Trust",
        "language": "React with TypeScript",
        "sourcename": "GitLab",
        "url": "https://gitlab.cecs.pdx.edu/prisoners-dilemma/site",
        "desc1": "An SPA web application for visualizing the effects of an individual's influence in a complex environment of personalities.",
        "desc2": "The project was built with ReactJS on NodeJS supported with graphics and animation using KonvaJS. We used an MVC architecture to organize our data structure interactions. Our development strategy was to use CI/CD where we each took on different development roles.",
        "desc3": "My contribution included implementation of a weighted, directed graph interface, modeling other data structures, animation rendering, and of course, debugging anything I could."
      },

      "proj2": {
        "header": "qnot",
        "language": "python with SQLite",
        "desc1": "A command-based note-taking utility designed for people who spend a lot of time in a terminal.",
        "desc2": "With qnot the user can quickly add a tagged note to a local SQLite database, straight from the command line without opening an interface. Notes can also be created and edited with the user's default text editor. ",
        "desc3": "Tagging notes is built in to the note-taking itself by allowing a '+' to be put before a word to turn it into a tag. Viewing and managing notes can be done via command line arguments and will open an interactive, command-based environment.",
        "sourcename": "GitHub",
        "url": "https://github.com/sqthreer/qnot"
      },

      "proj3": {
        "header": "solitaire",
        "language": "Java",
        "desc1": "A text-based game of solitaire; playable in a command-line.",
        "sourcename": "GitHub",
        "url": "https://github.com/sqthreer/solitaire"
      },

      "proj4": {
        "header": "Technical Practice",
        "language": "Various Languages",
        "desc1": "This is the repo for my answers to coding practice questions from various sources. Currently it contains a Roman numeral converter, a bubble sort implementation, a ransom note 'decoder', and a sliding window comparison.",
        "sourcename": "GitHub",
        "url": "https://github.com/sqthreer/technical-question-practice"
      }
    }
  }
}
