{
  "myname": "Blake Stephens",
  "subtitle": "Dev Portfolio",
  "homepage": "about",
  "pages": {
    "about": {
      "intro": {
        "greeting": "Hey, I'm Blake.",
        "desc": "I'm an aspiring software developer and an enthusiast of computer science and programming. I have spent the past four years earning a Bachelor's Degree in Computer Science to satisfy my long-running fascination with computers and to build functional skills I can use in a career. With the time I've spent in college I have learned that I am effective at dedicating myself to filling gaps in my knowledge as I encounter them. My eagerness to impress and create drives my motivation to get better at everything I do.",
        "gh": "GitHub",
        "li": "LinkedIn",
        "ghurl": "https://github.com/sqthreer",
        "liurl": "https://www.linkedin.com/in/blake-stephens-01bb5a42/"
      },
      "bio1": {
        "header": "Education",
        "desc": "The courses for my computer science major introduced me to the fundamentals of a broad range of computer science principles and practices. On top of that, I discovered how important it is to be relentless if your goal is to understand something.",
        "subheader1": "Degrees",
        "degree1": {
          "header": "Bachelor of Science in Computer Science",
          "date": "September 2018 to December 2022",
          "gpa": "Major GPA: 3.50"
        },
        "degree2": {
          "header": "Associate Degree in General Studies",
          "date": "September 2016 to September 2018"
        },
        "subheader2": "Courses",
        "courses": [
          "Data Structures",
          "Computer Systems Programming",
          "Programming Methodologies and Software Implementation",
          "Elements of Software Engineering",
          "Principles of Programming Languages",
          "Operating Systems",
          "Algorithms and Complexity",
          "Database Management Systems",
          "Computational Structures",
          "Programming in Rust",
          "Web Development",
          "Code Reading & Review",
          "Exploring Fractals",
          "Computer Security",
          "Linear Algebra",
          "Calculus",
          "Discrete Mathematics"
        ]
      },
      "bio2": {
        "header": "Otherwise",
        "desc1": "Outside of computers and programming I like to be in the outdoors. It can be a solo adventure to a new fishing spot, a few friends on a camping trip or boogie boarding in the freezing Pacific ocean-- and I'll be happy.",
        "desc2": "At home, if I'm not working on coding projects I like to read, draw, or build. Generally I prefer to spend my time either making something or moving around."
      }
    },

    "experience": {
      "intro": "My work and programming experience includes code collaboration with peers, designing and building computer science course material, IT troubleshooting on a Linux infrastructure, and lots of pizza.\r",

      "exp1": {
        "header": "Lab Facilitator",
        "subheader": "Portland State University",
        "date": "September 2021 to December 2022",
        "desc": "My general responsibilities were to present short lectures on data structures to lower-level computer science students and be available during labs to help debug or answer conceptual questions.",
        "list": [
          "Presenting and explaining data structure concepts to groups of students in labs",
          "Guiding individual students to solutions for programming problems using C++",
          "Developing and maintaining C++ code bases for use in computer science labs",
          "Coordinating lab and lecture materials development with project management software",
          "Proctoring student exams and coding proficiency demonstrations",
          "Training new employees with debugging exercises and code discussions"
        ]
      },

      "exp2": {
        "header": "Frontend Developer",
        "subheader": "PSU: Capstone Project",
        "date": "March 2022 to September 2022",
        "desc": "My participation in the Capstone project got me introduced to git workflows, front-end technologies and frameworks, and the beauty of collaboration.",
        "list": [
          "Developing an interactive web application using Node.js and React.js with TypeScript",
          "Data modeling for a graph data structure implemented with an MVC architecture",
          "Scrum-like collaborative procedures with a team of peers",
          "Collaborating with continuous integration using git and GitLab with CI/CD",
          "Researching unfamiliar technologies for use in project development"
        ]
      },

      "exp3": {
        "header": "Help Desk Volunteer",
        "subheader": "Portland State University",
        "date": "October 2020 to May 2021",
        "desc": "As a member of The Computer Action Team -the organization responsible for the technical infrastructure of Maseeh College of Engineering and Computer Science- I learned how to listen to user's describe their IT issues and respectfully guide them to solutions. Much of our day-to-day responsibilities involved writing and running scripts in a Linux environment to gather information or solve problems.",
        "list": [
          "Working directly with MCECS students and faculty for IT troubleshooting",
          "Collaborating on revisions to technical documentation and website content",
          "Attending weekly informational presentations on IT subjects",
          "Troubleshooting Linux system infrastructure issues"
        ]
      },
      "exp4": {
        "header": "Shift Manager",
        "subheader": "Mississippi Pizza",
        "date": "January 2016 to January 2022",
        "desc": "In this job I learned how to cooperate with my peers and communicate clearly and efficiently with customers. My time in a position of authority taught me how to respectfully interact with subordinates to maintain an awareness and coordination of time-sensitive tasks.",
        "list": [
          "Overseeing and delegating essential duties to staff of up to eight",
          "Regularly communicating with upper-management and accounting staff",
          "Diffusing confrontational interactions among staff or patrons",
          "Ensuring product quality in a fast-paced environment"
        ]
      }
    },

    "skills": {
      "intro": "I am very open to learning new technologies and using best practices when coding and developing. My curiousity motivates me to learn unfamiliar technologies and dev strategies, but my intent to be an asset to my employer motivates me to hone the skills I've got.",
      "skill1": {
        "header": "Language",
        "desc": "C, C++, Python, Java, HTML, CSS, TypeScript/JavaScript, Bash Script, Rust, SQL"
      },

      "skill2": {
        "header": "Technology",
        "desc": "Linux, Git, GDB, SQLite, PostreSQL, JSON, Regex"
      },

      "skill3": {
        "header": "Libraries/Frameworks",
        "desc": "C++ STL, React, NodeJS, Bootstrap, jQuery/AJAX"
      },

      "skill4": {
        "header": "IDEs/Editors",
        "desc": "Vim, VS Code, IntelliJ IDEA, PyCharm"
      },

      "skill5": {
        "header": "Design",
        "desc": "Photoshop"
      }
    },

    "work": {
      "intro": "I tend to take on personal projects to gain some exposure to different languages, libraries or frameworks. The work listed below range from an interactive web application to command-line utilities.",
      "proj1": {
        "header": "Isle of Trust",
        "language": "React with TypeScript",
        "sourcename": "GitLab",
        "url": "https://gitlab.cecs.pdx.edu/prisoners-dilemma/site",
        "desc1": "An SPA web application for visualizing the effects of an individual's influence in a complex environment of personalities.",
        "desc2": "The project was built with React on Node supported with graphics and animation using Konva. We used an MVC architecture to organize our data structure interactions. Our development strategy was to use CI/CD where we each took on different development roles.",
        "desc3": "My contributions included implementation of a weighted, directed graph interface, modeling simpler data structures, animation rendering, and of course, debugging anything I could."
      },

      "proj2": {
        "header": "qnot",
        "language": "Python with SQLite and Regex",
        "desc1": "A command-based note-taking utility designed for people who spend a lot of time with a terminal open.",
        "desc2": "With qnot the user can quickly add a tagged note to a local SQLite database, straight from the command line without opening an interface. Notes can also be created and edited with the user's default text editor or imported from existing files.",
        "desc3": "Although qnot makes it easy to add tagged notes with a single command from the Linux prompt, it also comes with a robust interface that enables many ways of retrieving and managing notes. Users can gather by tag or search the title and body of notes for keywords. Qnot also supports easily selecting multiple notes for exporting, merging, and batch deleting. A built-in, keyword-based help command allows users to figure out exactly how to use a particular qnot feature, or to understand general usage.",
        "sourcename": "GitHub",
        "url": "https://github.com/sqthreer/qnot"
      },

      "proj3": {
        "header": "Portfolio",
        "language": "React, Node, JavaScript, HTML, CSS, JSON",
        "desc1": "The site you're on now! This began as a final project for a web development class but I have continued its development as a portfolio.",
        "desc2": "This SPA was build on Node using React and Framer Motion for the UI and React Router to handle routing. Check out the README on the repo for a full list of dependencies and resources used.",
        "sourcename": "GitHub",
        "url": "https://github.com/sqthreer/sqthreer.github.io"
      },

      "proj4": {
        "header": "Solitaire",
        "language": "Java, Regex",
        "desc1": "A text-based game of solitaire playable in a command-line. Not yet completed!",
        "sourcename": "GitHub",
        "url": "https://github.com/sqthreer/solitaire"
      },

      "proj5": {
        "header": "Morse DeGOder",
        "language": "Go",
        "desc1": "A toy program to get some familiarity with Golang and take advantage of an opportunity to use a pun. It is a simple utility for decoding a string as morse code. Users can also customize which characters to consider 'dots' and 'dashes' for the purpose of finding secret messages in long strings of random text.",
        "desc2": "Uses a hard-coded binary tree structure to interpret strings then outputs what was decoded.",
        "sourcename": "GitHub",
        "url": "https://github.com/sqthreer/morse-deGOder"
      },

      "proj6": {
        "header": "Technical Practice",
        "language": "Various Languages",
        "desc1": "This is the repo for my answers to coding practice questions from various sources. Currently it contains a Roman numeral converter, a bubble sort implementation, a ransom note decoder, and a sliding window comparison.",
        "sourcename": "GitHub",
        "url": "https://github.com/sqthreer/technical-question-practice"
      }
    }
  }
}
